app/Controllers/Umkms.php

    public function create()
    {

        $data = $this->request->getPost();
        $umkm = new UmkmModel;
        $id = $umkm->insert($data);
---
INSERT INTO `umkms` (`nama_pemilik`, `nama_umkm`, `produk_umkm`, `alamat_umkm`, `foto_umkm`) VALUES ('Anggun', 'Anggun Store', 'jilbab', 'Bandung', 'foto.jpg')

    public function delete($id)
    {
        $umkm = new UmkmModel;
        $deleted = $umkm->delete($id);
---
DELETE FROM `umkms`
WHERE `id` IN ('2')